# 작업공간 설정
setwd("C:/Users/ghkdu/Desktop/덕성여대/학습프로젝트/2020 사회조사")

# 데이터 불러오기
Eco_raw <- read.csv("보건_교육_안전_가족_환경_2020_20210413_74060.csv", header=T)
head(Eco_raw)

# 저장된 변수명 확인
names(Eco_raw)

################################################################################

# 변수 선택 - 숫자형 벡터 만들기
select_variables <- c(4,5,12:18,20:24,48,51,104:116,123:129,141,152,160,
                      165:189,214,227,228,230,238,255,258,259,279,280)

# 선택된 변수만 가지는 새로운 데이터셋 Eco 생성
Eco <- Eco_raw[,select_variables]
names(Eco)

#########################################################

# 결측값 행 제거
library(dplyr)
Eco_data <- Eco %>% filter(!is.na(Eco_raw[,50]))

# 결측값 확인
table(Eco_data[,1], useNA="ifany")
table(Eco_data[,2], useNA="ifany")
table(Eco_data[,3], useNA="ifany")
table(Eco_data[,4], useNA="ifany")
table(Eco_data[,5], useNA="ifany")
table(Eco_data[,6], useNA="ifany")
table(Eco_data[,7], useNA="ifany")
table(Eco_data[,8], useNA="ifany")
table(Eco_data[,9], useNA="ifany")
table(Eco_data[,10], useNA="ifany")

################################################################################

# 역방향 코딩 및 재부호화
attach(Eco_data)
Eco_data$주관적.만족감[주관적.만족감==1] <- 5
Eco_data$주관적.만족감[주관적.만족감==2] <- 4
Eco_data$주관적.만족감[주관적.만족감==3] <- 3
Eco_data$주관적.만족감[주관적.만족감==4] <- 2
Eco_data$주관적.만족감[주관적.만족감==5] <- 1

Eco_data$건강평가[건강평가==1] <- 5
Eco_data$건강평가[건강평가==2] <- 4
Eco_data$건강평가[건강평가==3] <- 3
Eco_data$건강평가[건강평가==4] <- 2
Eco_data$건강평가[건강평가==5] <- 1

Eco_data$건강관리_아침.식사하기[건강관리_아침.식사하기==1] <- 2
Eco_data$건강관리_아침.식사하기[건강관리_아침.식사하기==2] <- 1
Eco_data$건강관리_적정수면.6.8시간.[건강관리_적정수면.6.8시간.==1] <- 2
Eco_data$건강관리_적정수면.6.8시간.[건강관리_적정수면.6.8시간.==2] <- 1
Eco_data$건강관리_규칙적.운동[건강관리_규칙적.운동==1] <- 2
Eco_data$건강관리_규칙적.운동[건강관리_규칙적.운동==2] <- 1
Eco_data$건강관리_정기.건강.검진[건강관리_정기.건강.검진==1] <- 2
Eco_data$건강관리_정기.건강.검진[건강관리_정기.건강.검진==2] <- 1

Eco_data$가족.관계.만족도_전반적인.가족.관계[가족.관계.만족도_전반적인.가족.관계==6] <- 3
Eco_data$가족.관계.만족도_전반적인.가족.관계[가족.관계.만족도_전반적인.가족.관계==1] <- 5
Eco_data$가족.관계.만족도_전반적인.가족.관계[가족.관계.만족도_전반적인.가족.관계==2] <- 4
Eco_data$가족.관계.만족도_전반적인.가족.관계[가족.관계.만족도_전반적인.가족.관계==3] <- 3
Eco_data$가족.관계.만족도_전반적인.가족.관계[가족.관계.만족도_전반적인.가족.관계==4] <- 2
Eco_data$가족.관계.만족도_전반적인.가족.관계[가족.관계.만족도_전반적인.가족.관계==5] <- 1

Eco_data$생활.환경.상황.변화.5년.후.[생활.환경.상황.변화.5년.후.==6] <- 3

Eco_data$환경.보호.비용.부담[환경.보호.비용.부담==1] <- 5
Eco_data$환경.보호.비용.부담[환경.보호.비용.부담==2] <- 4
Eco_data$환경.보호.비용.부담[환경.보호.비용.부담==3] <- 3
Eco_data$환경.보호.비용.부담[환경.보호.비용.부담==4] <- 2
Eco_data$환경.보호.비용.부담[환경.보호.비용.부담==5] <- 1

Eco_data$환경오염.방지.노력_대중교통이용[환경오염.방지.노력_대중교통이용==1] <- 4
Eco_data$환경오염.방지.노력_대중교통이용[환경오염.방지.노력_대중교통이용==2] <- 3
Eco_data$환경오염.방지.노력_대중교통이용[환경오염.방지.노력_대중교통이용==3] <- 2
Eco_data$환경오염.방지.노력_대중교통이용[환경오염.방지.노력_대중교통이용==4] <- 1
Eco_data$환경오염.방지.노력_재활용품.분리하여.배출하기[환경오염.방지.노력_재활용품.분리하여.배출하기==1] <- 4
Eco_data$환경오염.방지.노력_재활용품.분리하여.배출하기[환경오염.방지.노력_재활용품.분리하여.배출하기==2] <- 3
Eco_data$환경오염.방지.노력_재활용품.분리하여.배출하기[환경오염.방지.노력_재활용품.분리하여.배출하기==3] <- 2
Eco_data$환경오염.방지.노력_재활용품.분리하여.배출하기[환경오염.방지.노력_재활용품.분리하여.배출하기==4] <- 1
Eco_data$환경오염.방지.노력_음식물.쓰레기.줄이기[환경오염.방지.노력_음식물.쓰레기.줄이기==1] <- 4
Eco_data$환경오염.방지.노력_음식물.쓰레기.줄이기[환경오염.방지.노력_음식물.쓰레기.줄이기==2] <- 3
Eco_data$환경오염.방지.노력_음식물.쓰레기.줄이기[환경오염.방지.노력_음식물.쓰레기.줄이기==3] <- 2
Eco_data$환경오염.방지.노력_음식물.쓰레기.줄이기[환경오염.방지.노력_음식물.쓰레기.줄이기==4] <- 1
Eco_data$환경오염.방지.노력_합성.세제.사용.줄이기[환경오염.방지.노력_합성.세제.사용.줄이기==1] <- 4
Eco_data$환경오염.방지.노력_합성.세제.사용.줄이기[환경오염.방지.노력_합성.세제.사용.줄이기==2] <- 3
Eco_data$환경오염.방지.노력_합성.세제.사용.줄이기[환경오염.방지.노력_합성.세제.사용.줄이기==3] <- 2
Eco_data$환경오염.방지.노력_합성.세제.사용.줄이기[환경오염.방지.노력_합성.세제.사용.줄이기==4] <- 1
Eco_data$환경오염.방지.노력_일회용품.사용하지.않기[환경오염.방지.노력_일회용품.사용하지.않기==1] <- 4
Eco_data$환경오염.방지.노력_일회용품.사용하지.않기[환경오염.방지.노력_일회용품.사용하지.않기==2] <- 3
Eco_data$환경오염.방지.노력_일회용품.사용하지.않기[환경오염.방지.노력_일회용품.사용하지.않기==3] <- 2
Eco_data$환경오염.방지.노력_일회용품.사용하지.않기[환경오염.방지.노력_일회용품.사용하지.않기==4] <- 1
Eco_data$환경오염.방지.노력_친환경.제품.구입.사용하기[환경오염.방지.노력_친환경.제품.구입.사용하기==1] <- 4
Eco_data$환경오염.방지.노력_친환경.제품.구입.사용하기[환경오염.방지.노력_친환경.제품.구입.사용하기==2] <- 3
Eco_data$환경오염.방지.노력_친환경.제품.구입.사용하기[환경오염.방지.노력_친환경.제품.구입.사용하기==3] <- 2
Eco_data$환경오염.방지.노력_친환경.제품.구입.사용하기[환경오염.방지.노력_친환경.제품.구입.사용하기==4] <- 1
Eco_data$환경오염.방지.노력_자연.보호.및.환경.보전.활동.참여하기[환경오염.방지.노력_자연.보호.및.환경.보전.활동.참여하기==1] <- 4
Eco_data$환경오염.방지.노력_자연.보호.및.환경.보전.활동.참여하기[환경오염.방지.노력_자연.보호.및.환경.보전.활동.참여하기==2] <- 3
Eco_data$환경오염.방지.노력_자연.보호.및.환경.보전.활동.참여하기[환경오염.방지.노력_자연.보호.및.환경.보전.활동.참여하기==3] <- 2
Eco_data$환경오염.방지.노력_자연.보호.및.환경.보전.활동.참여하기[환경오염.방지.노력_자연.보호.및.환경.보전.활동.참여하기==4] <- 1
Eco_data$환경오염.방지.노력_물.절약하기[환경오염.방지.노력_물.절약하기==1] <- 4
Eco_data$환경오염.방지.노력_물.절약하기[환경오염.방지.노력_물.절약하기==2] <- 3
Eco_data$환경오염.방지.노력_물.절약하기[환경오염.방지.노력_물.절약하기==3] <- 2
Eco_data$환경오염.방지.노력_물.절약하기[환경오염.방지.노력_물.절약하기==4] <- 1
Eco_data$환경오염.방지.노력_가정.내.대기전력.줄이기[환경오염.방지.노력_가정.내.대기전력.줄이기==1] <- 4
Eco_data$환경오염.방지.노력_가정.내.대기전력.줄이기[환경오염.방지.노력_가정.내.대기전력.줄이기==2] <- 3
Eco_data$환경오염.방지.노력_가정.내.대기전력.줄이기[환경오염.방지.노력_가정.내.대기전력.줄이기==3] <- 2
Eco_data$환경오염.방지.노력_가정.내.대기전력.줄이기[환경오염.방지.노력_가정.내.대기전력.줄이기==4] <- 1

Eco_data$분류코드_교육정도[분류코드_교육정도==71] <- 4
Eco_data$분류코드_교육정도[분류코드_교육정도==72] <- 3
Eco_data$분류코드_교육정도[분류코드_교육정도==73] <- 2
Eco_data$분류코드_교육정도[분류코드_교육정도==74] <- 1

Eco_data$분류코드.가구소득[분류코드.가구소득==610] <- 1
Eco_data$분류코드.가구소득[분류코드.가구소득==620] <- 2
Eco_data$분류코드.가구소득[분류코드.가구소득==630] <- 3
Eco_data$분류코드.가구소득[분류코드.가구소득==640] <- 4
Eco_data$분류코드.가구소득[분류코드.가구소득==650] <- 5
Eco_data$분류코드.가구소득[분류코드.가구소득==660] <- 6
Eco_data$분류코드.가구소득[분류코드.가구소득==678] <- 7

Eco_data$분류코드_세대구분[분류코드_세대구분==51] <- 1
Eco_data$분류코드_세대구분[분류코드_세대구분==52] <- 0
Eco_data$분류코드_세대구분[분류코드_세대구분==53] <- 0
Eco_data$분류코드_세대구분[분류코드_세대구분==54] <- 0
Eco_data$분류코드_세대구분[분류코드_세대구분==55] <- 0

Eco_data$address <- 0
Eco_data$address[행정구역.시도.==11] <- 1
Eco_data$address[행정구역.시도.==23] <- 1
Eco_data$address[행정구역.시도.==31] <- 1

################################################################################

attach(Eco_data)

# PCA
PCA1 <- Eco_data[,3:8]
PCA2 <- Eco_data[,11:14]
PCA3 <- Eco_data[,17:28]
PCA4 <- Eco_data[,30:36]
PCA5 <- Eco_data[,40:46]
PCA6 <- Eco_data[,50:55]
PCA7 <- Eco_data[,56:64]

fit1  <- princomp(PCA1, cor=TRUE)
summary(fit1)
plot(fit1, type="lines")

fit2  <- princomp(PCA2, cor=TRUE)
summary(fit2)
plot(fit2, type="lines")

fit3  <- princomp(PCA3, cor=TRUE)
summary(fit3)
plot(fit3, type="lines")

fit4  <- princomp(PCA4, cor=TRUE)
summary(fit4)
plot(fit4, type="lines")

fit5  <- princomp(PCA5, cor=TRUE)
summary(fit5)
plot(fit5, type="lines")

fit6  <- princomp(PCA6, cor=TRUE)
summary(fit6)
plot(fit6, type="lines")

fit7  <- princomp(PCA7, cor=TRUE)
summary(fit7)
plot(fit7, type="lines")

################################################################################

attach(Eco_data)

# column명 변경
names(Eco_data) [names(Eco_data) == "만나이"] <- c("age")
names(Eco_data) [names(Eco_data) == "성별"] <- c("sex")
names(Eco_data) [names(Eco_data) == "주관적.만족감"] <- c("satisfaction")
names(Eco_data) [names(Eco_data) == "건강평가"] <- c("health")
names(Eco_data) [names(Eco_data) == "스트레스.정도_전반적인.일상생활.지난.2주."] <- c("stress")
names(Eco_data) [names(Eco_data) == "암에.대한.두려움"] <- c("cancer.fear")
names(Eco_data) [names(Eco_data) == "가족.관계.만족도_전반적인.가족.관계"] <- c("family.relationship")
names(Eco_data) [names(Eco_data) == "생활.환경.상황.변화.5년.전."] <- c("previous.environment")
names(Eco_data) [names(Eco_data) == "생활.환경.상황.변화.5년.후."] <- c("post.environment")
names(Eco_data) [names(Eco_data) == "환경.보호.비용.부담"] <- c("environmental.cost")
names(Eco_data) [names(Eco_data) == "분류코드_세대구분"] <- c("house.type")
names(Eco_data) [names(Eco_data) == "분류코드_교육정도"] <- c("study")
names(Eco_data) [names(Eco_data) == "분류코드.가구소득"] <- c("income")

# 변수생성
Eco_data$restrictions = Eco_data[,3]+Eco_data[,4]+Eco_data[,5]+Eco_data[,6]+Eco_data[,7]+Eco_data[,8]
Eco_data$healthcare = Eco_data[,11]+Eco_data[,12]+Eco_data[,13]+Eco_data[,14]
Eco_data$social.safety = Eco_data[,17]+Eco_data[,18]+Eco_data[,19]+Eco_data[,20]+Eco_data[,21]+Eco_data[,22]+Eco_data[,23]+Eco_data[,24]+Eco_data[,25]+Eco_data[,26]+Eco_data[,27]+Eco_data[,28]
Eco_data$environment.feel = Eco_data[,40]+Eco_data[,41]+Eco_data[,42]+Eco_data[,43]+Eco_data[,44]+Eco_data[,45]+Eco_data[,46]
Eco_data$environmental.issues = Eco_data[,50]+Eco_data[,51]+Eco_data[,52]+Eco_data[,53]+Eco_data[,54]+Eco_data[,55]
Eco_data$prevention.pollution = Eco_data[,56]+Eco_data[,57]+Eco_data[,58]+Eco_data[,59]+Eco_data[,60]+Eco_data[,61]+Eco_data[,62]+Eco_data[,63]+Eco_data[,64]

################################################################################

attach(Eco_data)

# 빈도표, 히스토그램 : 성별, 연령, 시도
library(summarytools)
view(freq(sex))
view(freq(address))
hist(age)

# 기술통계량
summary(age)

# scatter plot
plot(Eco_data[,c("age","sex","address")])

# parallel plot
library(lattice)
parallelplot(Eco_data[,c("age","sex","address")], main="parallel graph")

# face plot
library(aplpack)
faces(Eco_data[1:20,c("age","sex","address")], main="face plot for cork")

# star graph
library(aplpack)
stars(Eco_data[1:20,c("age","sex","address")], main="star graph")

# Nightinggale chart
stars(Eco_data[1:20,c("age","sex","address")], draw.segments=T, main="Nightinggale chart")

# 상자그림
boxplot(age, xlab="연령")

#########################################################

# 데이터 저장하기
save(Eco_data, file="Eco_data.RData")

# [1] "age"                                                               
# [2] "sex"                                                               
# [3] "활동.제약.상태_안경을.써도.보는.데.어려움"                         
# [4] "활동.제약.상태_보청기를.사용해도.듣는.데.어려움"                   
# [5] "활동.제약.상태_계단을.오르는.데.어려움"                            
# [6] "활동.제약.상태_기억하거나.집중하는.데.어려움"                      
# [7] "활동.제약.상태_스스로.자기.관리.활동을.하는.데.어려움"             
# [8] "활동.제약.상태_일상생활에서.말을.하거나.듣고..이해하는.데.어려움"  
# [9] "satisfaction"                                                      
# [10] "health"                                                            
# [11] "건강관리_아침.식사하기"                                            
# [12] "건강관리_적정수면.6.8시간."                                        
# [13] "건강관리_규칙적.운동"                                              
# [14] "건강관리_정기.건강.검진"                                           
# [15] "stress"                                                            
# [16] "cancer.fear"                                                       
# [17] "사회.안전에.대한.인식도_국가.안보.문제"                            
# [18] "사회.안전에.대한.인식도_자연재해"                                  
# [19] "사회.안전에.대한.인식도_건축물.및.시설물.위험"                     
# [20] "사회.안전에.대한.인식도_교통사고"                                  
# [21] "사회.안전에.대한.인식도_화재.산불포함."                            
# [22] "사회.안전에.대한.인식도_먹거리.위생.문제.불량식품..식중독.등."     
# [23] "사회.안전에.대한.인식도_식량.안보.문제"                            
# [24] "사회.안전에.대한.인식도_정보.보안.문제"                            
# [25] "사회.안전에.대한.인식도_개인.정보.유출"                            
# [26] "사회.안전에.대한.인식도_신종.질병.신종.바이러스.등."               
# [27] "사회.안전에.대한.인식도_범죄"                                      
# [28] "사회.안전에.대한.인식도_전반적인.사회.안전"                        
# [29] "social.anxiety"                                                    
# [30] "공공질서.준수.수준_차례.지키기"                                    
# [31] "공공질서.준수.수준_거리.환경.유지"                                 
# [32] "공공질서.준수.수준_보행질서"                                       
# [33] "공공질서.준수.수준_운전자.교통질서"                                
# [34] "공공질서.준수.수준_금연구역.준수"                                  
# [35] "공공질서.준수.수준_공공장소.정숙"                                  
# [36] "공공질서.준수.수준_교통약자.보호석.지키기"                         
# [37] "marriage.view"                                                     
# [38] "chores.sharing"                                                    
# [39] "family.relationship"                                               
# [40] "현재.체감.환경_대기"                                               
# [41] "현재.체감.환경_하천"                                               
# [42] "현재.체감.환경_토양"                                               
# [43] "현재.체감.환경_소음.진동"                                          
# [44] "현재.체감.환경_빛.공해"                                            
# [45] "현재.체감.환경_녹지.환경"                                          
# [46] "현재.체감.환경_전반적인.생활.환경"                                 
# [47] "previous.environment"                                              
# [48] "post.environment"                                                  
# [49] "environmental.cost"                                                
# [50] "환경문제.에.대한.인식._기후변화.폭염..홍수.등."                    
# [51] "환경문제에.대한.인식_유해.화학.물질.가습기.살균제..새집.증후군.등."
# [52] "환경문제에.대한.인식_방사능"                                       
# [53] "환경문제에.대한.인식_미세.먼지"                                    
# [54] "환경문제에.대한.인식_농약..화학.비료"                              
# [55] "환경문제에.대한.인식_수돗물"                                       
# [56] "환경오염.방지.노력_대중교통이용"                                   
# [57] "환경오염.방지.노력_재활용품.분리하여.배출하기"                     
# [58] "환경오염.방지.노력_음식물.쓰레기.줄이기"                           
# [59] "환경오염.방지.노력_합성.세제.사용.줄이기"                          
# [60] "환경오염.방지.노력_일회용품.사용하지.않기"                         
# [61] "환경오염.방지.노력_친환경.제품.구입.사용하기"                      
# [62] "환경오염.방지.노력_자연.보호.및.환경.보전.활동.참여하기"           
# [63] "환경오염.방지.노력_물.절약하기"                                    
# [64] "환경오염.방지.노력_가정.내.대기전력.줄이기"                        
# [65] "house.type"                                                        
# [66] "study"                                                             
# [67] "marriage"                                                          
# [68] "employ"                                                            
# [69] "income"                                                            
# [70] "address"                                                           
# [71] "smoke"                                                             
# [72] "drink"                                                             
# [73] "승수.가구._weight"                                                 
# [74] "승수.가구원._weight"                                               
# [75] "restrictions"                                                      
# [76] "healthcare"                                                        
# [77] "social.safety"                                                     
# [78] "public.order"                                                      
# [79] "environment.feel"                                                  
# [80] "environmental.issues"                                              
# [81] "prevention.pollution"
